doom/.config/doom/config.org
***** Rename Buffer and File Name
Rename the current buffer and the file name based on the org-roam properties. This will also work in Dired at the point or for marked files.
#+begin_src emacs-lisp
(defun rename-buffer-and-file-based-on-org-roam ()
  "Rename the current buffer and the file it is visiting based on Org-roam ID and Title.
If in dired mode, rename the selected file instead."
  (interactive)
  (if (derived-mode-p 'dired-mode)
      ;; Handle renaming in dired mode
      (let ((file (dired-get-file-for-visit)))
        (with-temp-buffer
          (insert-file-contents file)
          (let (id title new-name)
            ;; Extract the ID
            (when (re-search-forward "^:ID:\\s-+\\([A-Za-z0-9-]+\\)" nil t)
              (setq id (match-string 1)))
            ;; Extract the Title
            (goto-char (point-min))
            (when (re-search-forward "^#\\+TITLE:\\s-+\\(.+\\)" nil t)
              (setq title (match-string 1)))
            ;; Convert Title to kebab-case
            (when title
              (setq title (replace-regexp-in-string "[^a-zA-Z0-9]+" "-" (downcase title)))
              (setq new-name (concat id "-" title)))
            ;; Rename file
            (when (and id title)
              (let ((new-file-name (concat (file-name-directory file) new-name ".org")))
                (rename-file file new-file-name 1)
                (revert-buffer)
                (dired-revert)
                (message "Renamed %s to %s" file new-file-name))))))
    ;; Handle renaming in org-mode
    (when (derived-mode-p 'org-mode)
      (save-excursion
        (goto-char (point-min))
        (let (id title new-name)
          ;; Extract the ID
          (when (re-search-forward "^:ID:\\s-+\\([A-Za-z0-9-]+\\)" nil t)
            (setq id (match-string 1)))
          ;; Extract the Title
          (goto-char (point-min))
          (when (re-search-forward "^#\\+TITLE:\\s-+\\(.+\\)" nil t)
            (setq title (match-string 1)))
          ;; Convert Title to kebab-case
          (when title
            (setq title (replace-regexp-in-string "[^a-zA-Z0-9]+" "-" (downcase title)))
            (setq new-name (concat id "-" title)))
          ;; Rename buffer and file
          (when (and id title)
            (let ((new-file-name (concat (file-name-directory (buffer-file-name)) new-name ".org")))
              (rename-file (buffer-file-name) new-file-name 1)
              (set-visited-file-name new-file-name)
              (rename-buffer new-name)
              (save-buffer)
              (message "Renamed buffer and file to %s" new-name))))))))

(global-set-key (kbd "C-c r") 'rename-buffer-and-file-based-on-org-roam)
#+end_src
***** TagID Generator
#+begin_src emacs-lisp
(defun mho/gen-id ()
  "Generate a full_id composed of a date stamp and the first available ID from a
   file, prompt the user before deleting the line, and save the ID to the kill
   ring."
  (interactive)
  (let* ((id-file "~/Documents/mho-roam/resources/code/shell/TAGS-tagids.txt")  ; Adjust the path as needed
         ;;(date-str (format-time-string "%y%m%d"))
         (buffer (find-file-noselect id-file))
         full_id)
    (with-current-buffer buffer
      (goto-char (point-min))
      (let ((first-id (buffer-substring-no-properties (point) (line-end-position))))
        ;;(setq full_id (concat date-str "--" first-id))  ; Changed format for clarity
        (setq full_id first-id)  ; Changed format for clarity
        (if (yes-or-no-p (format "Delete the first line containing ID: %s?" first-id))
            (progn
              (delete-region (point) (1+ (line-end-position)))
              (save-buffer)
              (kill-buffer)
              (kill-new full_id)
              (message "ID %s saved to kill ring" full_id))
          (message "ID generation aborted"))))))
#+end_src
***** Auto Generate Org-Roam ID
#+begin_src emacs-lisp
(defvar mho/org-roam-last-id nil "Cache the last generated ID for reuse in the same capture session.")

(defun get-and-update-full-id ()
  ;; "Generate a full_id composed of a date stamp and the first available ID from a file."
  (unless mho/org-roam-last-id
    (setq mho/org-roam-last-id
          (let* ((id-file "~/Documents/mho-roam/resources/code/shell/TAGS-tagids.txt")  ; Adjust the path as needed
                 ;;(date-str (format-time-string "%y%m%d"))
                 (buffer (find-file-noselect id-file))
                 full_id)
            (with-current-buffer buffer
              (goto-char (point-min))
              (let ((first-id (buffer-substring-no-properties (point) (line-end-position))))
                ;;(setq full_id (concat date-str "--" first-id))  ; Changed format for clarity
                (setq full_id first-id)  ; Changed format for clarity
                (delete-region (point) (1+ (line-end-position)))
                (save-buffer)
                (kill-buffer))
              full_id))))
  mho/org-roam-last-id)

(add-hook 'org-capture-after-finalize-hook (lambda () (setq mho/org-roam-last-id nil)))
#+end_src
