doom/.config/doom/config.el

(use-package laas
  :hook (LaTeX-mode . laas-mode)
  :config ; do whatever here
  (aas-set-snippets 'laas-mode
    "jf" (lambda () (interactive)
           (yas-expand-snippet "\\\\( $1 \\\\) $0"))
    "ägp" (lambda () (interactive)
            (yas-expand-snippet "\\graphicspath{{\\string~/Library/CloudStorage/Dropbox/assets/}}"))
    "ääm" (lambda () (interactive)
            (yas-expand-snippet "\\inputminted{python}{0-tex/py_code-${1:tagID}.py}"))
    ;; set condition!
    :cond #'texmathp ; expand only while in math
    "==" "&="
    "bfb" "\\framebreak%"
    "d1" "\\diff{y}{x}"
    "d2" "\\diff[2]{y}{x}"
    "dx" "\\dl x"
    "dy" "\\dl y"
    "ee" "^"
    "fx" "f(x)"
    "fp" "\\fprime"
    "ffp" "\\fprime (x)"
    "fffp" "\\fprime\\fprime (x)"
    "gx" "g(x)"
    "gp" "g'(x)"
    "ggp" "g''(x)"
    "hx" "h(x)"
    "jg" "\\\\"
    "lg" "\\lg"
    "lc" "\\$0"
    "mst" "\\suchthat"
    "nn" "\\oneg"
    "xx" "\\cdot"
    ;; bind to functions!
    "cr" (lambda () (interactive)
           (yas-expand-snippet "\\cRed{${1:arg}}$0"))
    "sv" (lambda () (interactive)
           (yas-expand-snippet "\\farg{${1:arg}}$0"))
    "ssv" (lambda () (interactive)
            (yas-expand-snippet "\\fargpass{${1:arg}}$0"))
    "sssv" (lambda () (interactive)
             (yas-expand-snippet "\\fargr{${1:arg}}$0"))
    "sit" (lambda () (interactive)
            (yas-expand-snippet "\\shortintertext{$1}$0"))
    "uu" (lambda () (interactive)
           (yas-expand-snippet "\\qty{${1:num}}{${2:unit}}$0"))
    "äf" (lambda () (interactive)
           (yas-expand-snippet "\\dfrac{${1:num}}{${2:den}}$0"))
    "ääf" (lambda () (interactive)
            (yas-expand-snippet "\\rfrac{${1:num}}{${2:den}}$0"))
    "äääf" (lambda () (interactive)
             (yas-expand-snippet "\\frac{${1:num}}{${2:den}}$0"))
    "åå" (lambda () (interactive)
           (yas-expand-snippet "\\mpar{${1:arg}}$0"))
    "åä" (lambda () (interactive)
           (yas-expand-snippet "\\sqpar{${1:terms}}$0"))
    "äa" (lambda () (interactive)
           (yas-expand-snippet "\\abs{${1:arg}}$0"))
    "äb" (lambda () (interactive)
           (yas-expand-snippet "\\set{${1:terms}}$0"))
    "äi" (lambda () (interactive)
           (yas-expand-snippet "\\ds\\int {${1:integrand}}, \\dl{${2:x}}$0"))
    "ääi" (lambda () (interactive)
            (yas-expand-snippet "\\defint{${1:integrand}}{${2:lower lim}}{${3:upper lim}} \\, \\dl{${2:x}}$0"))
    "äääi" (lambda () (interactive)
             (yas-expand-snippet "\\ieval{${1:integrand}}{${2:lower lim}}{${3:upper lim}}$0"))
    "äl" (lambda () (interactive)
           (yas-expand-snippet "\\dstylim{${1:var}}{${2:to}}{${3:expression}}$0"))
    "äs" (lambda () (interactive)
           (yas-expand-snippet "\\sqrt{${1:arg}}$0"))
    "ääs" (lambda () (interactive)
            (yas-expand-snippet "\\sqrt[${1:root}]{${2:arg}}$0"))
    "äääs" (lambda () (interactive)
             (yas-expand-snippet "\\set{${1:terms}}$0"))
    "ät" (lambda () (interactive)
           (yas-expand-snippet "\\text{${1:text}}$0"))
    ;; add accent snippets
    :cond #'laas-object-on-left-condition
    ;; ";sr" (lambda () (interactive) (laas-wrap-previous-object "sqrt"))
    ))

(require 'lorem-ipsum)

(setenv "PATH" "/usr/local/bin:/Library/TeX/texbin/:$PATH" t)

(setq TeX-save-query nil)

(setq TeX-show-compilation t)

(setq TeX-command-extra-options "-shell-escape")

(after! latex
  (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t)))

(setq +latex-viewers '(skim preview))
(setq TeX-view-program-list
      '(("Preview" "/usr/bin/open -a Preview.app %o")
        ("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline -r -b %n %o %b")))
(setq TeX-view-program-selection
      '((output-dvi "Skim") (output-pdf "Skim") (output-html "open")));;

(setq TeX-source-correlate-mode t)
(setq TeX-source-correlate-start-server t)
(setq TeX-source-correlate-method 'synctex)

(setq org-latex-pdf-process '("LC_ALL=en_US.UTF-8 latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o %f"))

(setq org-directory "~/Documents/mho-roam/")

(use-package! org
  :config
  (setq org-image-actual-width 400)
  ;; Set Org-ID method to use the custom function
  (defun mho/org-id-new ()
    "Generate a new custom ID for Org mode using the custom full ID generator."
    (let ((new-id (get-and-update-full-id)))
      (setq mho/org-roam-last-id new-id)
      new-id))

  ;; Ensure org-id-get-create uses the custom ID generation method
  (defun org-id-get-create (&optional where force)
    "Create an ID for the entry at WHERE and return it. If FORCE is non-nil,
    recreate the ID if one already exists."
    (interactive)
    (let ((id (org-id-get where force)))
      (unless id
        (setq id (mho/org-id-new))
        (org-entry-put where "ID" id))
      id)
    (setq mho/org-roam-last-id nil))

  (setq org-id-method 'org)
  )

(defun mho/org-insert-file-link ()
  "Insert a file link.  At the prompt, enter the filename."
  (interactive)
  (org-insert-link nil (org-link-complete-file)))

(map! :after org
      :map org-mode-map
      :localleader
      "l f" #'mho/org-insert-file-link
)

(use-package! ob-mermaid
  :after org)
(setq ob-mermaid-cli-path "/opt/homebrew/bin/mmdc")
(org-babel-do-load-languages
    'org-babel-load-languages
    '((mermaid . t)
      (scheme . t)
      (swift . t)
      (your-other-langs . t)))

(use-package! ob-swift
  :after org)

(use-package! ox-typst
  :after org
  :config
  (defun org-typst-template (contents info)
  ;; Always return an empty string
  contents)
  )

(after! org
