doom/.config/doom/config.org
*** TODO AGENDA
#+begin_src emacs-lisp
(after! org
  ;; C-c c is for capture, it’s good enough for me
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)

  ;; Org Capture Templates
  ;; (setq org-capture-templates
  ;;       (quote (("h" "home" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Home")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_home.org"))
  ;;               ("w" "work" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_work.org"))
  ;;               ("f" "task from [f]ile into inbox" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_file.org"))
  ;;               ("p" "[p]roject" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_project.org"))
  ;;               ("l" "web link" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_weblink.org"))
  ;;               ("e" "exam" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_exam.org"))
  ;;               ("g" "gmail" entry (file+headline "~/Library/CloudStorage/Dropbox/org/gtd.org" "Work")
  ;;                (file "~/Library/CloudStorage/Dropbox/org/template_gmail.org"))
  ;;               )))

  ;; Skip finished items
  (setq org-agenda-todo-ignore-scheduled t)
  (setq org-agenda-todo-ignore-deadlines t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-scheduled-if-done t)

  ;; TODOs Keywords
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "ONGOING(o)" "MEET(m)" "PROJ(p)" "|" "DONE(d)")
          (sequence "WAIT(w)"  "|" "CANCEL(c)"))
        )

  ;; Add Week numbers to Agenda Calendar
  ;; (setq calendar-week-start-day 1)
  ;; (copy-face font-lock-constant-face 'calendar-iso-week-face)
  ;; (set-face-attribute 'calendar-iso-week-face nil
  ;;                     :height 1.0
  ;;                     :foreground "#D08770")
  ;; (setq calendar-intermonth-text
  ;;       '(propertize
  ;;         (format "%2d"
  ;;                 (car
  ;;                  (calendar-iso-from-absolute
  ;;                   (calendar-absolute-from-gregorian (list month day year)))))
  ;;         'font-lock-face 'calendar-iso-week-face))
  ;; (setq calendar-intermonth-header
  ;;       (propertize "Wk"                  ; or e.g. "KW" in Germany
  ;;                   'font-lock-face 'calendar-iso-week-header-face)
  ;;       )
  ;; Set default org image to 550
  ;;(setq org-image-actual-width (list 550))

  ;; Add timestamp to completed tasks
  (setq org-log-done 'time
        org-log-into-drawer t
        org-log-state-notes-insert-after-drawers nil)
  ;; Hide emphasis markers on formatted text
  (setq org-hide-emphasis-markers t)
  )
;; Load org-faces to make sure we can set appropriate faces
;;(require 'org-faces)

;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
;; (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
;; (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
;; (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
;; (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
;; (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
;; (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
;; (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
;; (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

(after! hl-todo
  (setq hl-todo-keyword-faces
        `(("MEET" . "#81A1C1")
          ("NEXT" . "#D08770")
          ("ONGOING" . "#A3BE8C")
          ("TODO" . "#88C0D0")
          ("PROJ" . "#EBCB8B")
          ("WAIT" . "#8FBCBB")
          ("CANCEL" . "#BF616A")
          ))
  )

;; ORG-SUPER AGENDA
;; (after! org-agenda
;;   (let ((inhibit-message t))
;;     (org-super-agenda-mode)))

;; (setq org-agenda-skip-scheduled-if-done t
;;       org-agenda-skip-deadline-if-done t
;;       org-agenda-include-deadlines t
;;       org-agenda-block-separator nil
;;       org-agenda-tags-column -80 ;; from testing this seems to be a good value
;;       org-agenda-compact-blocks t)

;; (setq org-agenda-custom-commands
;;       '(("o" "Overview"
;;          ((agenda "" ((org-agenda-span 'day)
;;                       (org-super-agenda-groups
;;                        '((:name "Today"
;;                           :time-grid t
;;                           :date today
;;                           :todo "TODAY"
;;                           :scheduled today
;;                           :order 1)))))
;;           (alltodo "" ((org-agenda-overriding-header "")
;;                        (org-super-agenda-groups
;;                         '((:name "Ongoing"
;;                            :todo "ONGOING"
;;                            :order 0)
;;                           (:name "Important"
;;                            :tag "Important"
;;                            :priority "A"
;;                            :order 1)
;;                           (:name "Due Today"
;;                            :deadline today
;;                            :order 2)
;;                           (:name "Due Soon"
;;                            :deadline future
;;                            :order 3)
;;                           (:name "Overdue"
;;                            :deadline past
;;                            :face error
;;                            :order 4)
;;                           (:name "Projects"
;;                            :todo "PROJ"
;;                            :auto-parent t
;;                            :order 10
;;                            :not (:todo "TODO"))
;;                           (:name "Work"
;;                            :tag "work"
;;                            :auto-parent t
;;                            :order 12)
;;                           (:name "Home"
;;                            :tag "home"
;;                            :order 13)
;;                           (:discard (:todo "DONE"))))))))))
;;=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
;; ORG-POMODORO Sounds
;;=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
;; (after! org-pomodoro
;;   (setq org-pomodoro-start-sound "/System/Library/Sounds/Glass.aiff")
;;   (setq org-pomodoro-finished-sound "/System/Library/Sounds/Blow.aiff")
;;   (setq org-pomodoro-short-break-sound "/System/Library/Sounds/Bottle.aiff")
;;   (setq org-pomodoro-long-break-sound "/System/Library/Sounds/Bottle.aiff")
;;   )
;; Function to play the start sound
;; (defun my/org-pomodoro-start-sound ()
;;   (start-process-shell-command
;;    "org-pomodoro-start-sound" nil "afplay /System/Library/Sounds/Glass.aiff"))

;; ;; Function to play the finish sound
;; (defun my/org-pomodoro-finished-sound ()
;;   (start-process-shell-command
;;    "org-pomodoro-finished-sound" nil "afplay /System/Library/Sounds/Blow.aiff"))

;; ;; Function to play the break sound
;; (defun my/org-pomodoro-break-sound ()
;;   (start-process-shell-command
;;    "org-pomodoro-break-sound" nil "afplay /System/Library/Sounds/Bottle.aiff"))

;; ;; Attach custom sounds to org-pomodoro hooks
;; (add-hook 'org-pomodoro-started-hook 'my/org-pomodoro-start-sound)
;; (add-hook 'org-pomodoro-finished-hook 'my/org-pomodoro-finished-sound)
;; (add-hook 'org-pomodoro-break-finished-hook 'my/org-pomodoro-break-sound))

#+end_src

#+RESULTS:
: ((MEET . #81A1C1) (NEXT . #D08770) (ONGOING . #A3BE8C) (TODO . #88C0D0) (PROJ . #EBCB8B) (WAIT . #8FBCBB) (CANCEL . #BF616A))
