doom/.config/doom/config.org
*** Todo list
**** Set Archive Location
Setting the value of the ~org-archive-location~, where
- ~%s~ :: is the name of the file name
- ~_archive~ :: is appended to the filename
- ~::~ :: separates the filename from the location within the file
- ~datetree/~ :: specifies that archived tasks should be stored in a date tree
#+begin_src emacs-lisp
(setq org-archive-location "%s_archive::datetree/")
#+end_src
**** Custom Archive all Function
#+begin_emacs-lisp
(defun mho/task-archives-to-datetree ()
  "Archive all completed tasks in the current Org file into a date tree."
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE|CANCELLED" 'file))
#+end_emacs-lisp
** Python
#+begin_src emacs-lisp
;;(setq org-babel-python-command "~/anaconda3/bin/python")
;;(after! python
;;  (setq python-shell-interpreter "~/anaconda3/bin/python"))
#+end_src
** Typst
#+begin_src emacs-lisp
(with-eval-after-load 'eglot
  (with-eval-after-load 'typst-ts-mode
    (add-to-list 'eglot-server-programs
                 `((typst-ts-mode) .
                   ,(eglot-alternatives `(,typst-ts-lsp-download-path
                                          "tinymist"
                                          "typst-lsp"))))))
#+end_src


Thanks to https://github.com/braun-steven/dotfiles/tree/master/configs/emacs/.doom.d
#+begin_src emacs-lisp
;; (use-package! typst-ts-mode
;;   :defer t
;;   :custom (progn
;;   (typst-ts-mode-watch-options "--open")
;;   ;; experimental settings (from the main dev)
;;   (typst-ts-mode-enable-raw-blocks-highlight t)
;;   (typst-ts-mode-highlight-raw-blocks-at-startup t))

;; :config

;; Functions
;; (defun mho/typstfmt-current-buffer ()
;;   "Formats the current typst document using the typstfmt binary."
;;   (interactive)
;;   (if (buffer-file-name)
;;       (shell-command (concat "typstfmt " (shell-quote-argument (buffer-file-name))))
;;     (message "Buffer is not associated with a file.")))

;; ;; Keybindings
;; (map! :map typst-ts-mode-map

;;       :localleader

;;       :desc "View" "v"     #'typst-ts-mode-preview
;;       :desc "Watch" "w"     #'typst-ts-mode-watch-toggle
;;       :desc "Compile" "c"     #'typst-ts-mode-compile-and-preview
;;       :desc "Format" ","    #'mho/typstfmt-current-buffer
;;       )
;; Add typst to list
;; (add-to-list 'treesit-language-source-alist
;;              '(typst "https://github.com/uben0/tree-sitter-typst"))

;; Necessary or else localleader is not detected
;; (add-hook 'typst-ts-mode-hook #'evil-normalize-keymaps))
#+end_src
