doom/.config/doom/config.el

;;(setq org-babel-python-command "~/anaconda3/bin/python")
;;(after! python
;;  (setq python-shell-interpreter "~/anaconda3/bin/python"))

(with-eval-after-load 'eglot
  (with-eval-after-load 'typst-ts-mode
    (add-to-list 'eglot-server-programs
                 `((typst-ts-mode) .
                   ,(eglot-alternatives `(,typst-ts-lsp-download-path
                                          "tinymist"
                                          "typst-lsp"))))))

;; (use-package! typst-ts-mode
;;   :defer t
;;   :custom (progn
;;   (typst-ts-mode-watch-options "--open")
;;   ;; experimental settings (from the main dev)
;;   (typst-ts-mode-enable-raw-blocks-highlight t)
;;   (typst-ts-mode-highlight-raw-blocks-at-startup t))

;; :config

;; Functions
;; (defun mho/typstfmt-current-buffer ()
;;   "Formats the current typst document using the typstfmt binary."
;;   (interactive)
;;   (if (buffer-file-name)
;;       (shell-command (concat "typstfmt " (shell-quote-argument (buffer-file-name))))
;;     (message "Buffer is not associated with a file.")))

;; ;; Keybindings
;; (map! :map typst-ts-mode-map

;;       :localleader

;;       :desc "View" "v"     #'typst-ts-mode-preview
;;       :desc "Watch" "w"     #'typst-ts-mode-watch-toggle
;;       :desc "Compile" "c"     #'typst-ts-mode-compile-and-preview
;;       :desc "Format" ","    #'mho/typstfmt-current-buffer
;;       )
;; Add typst to list
;; (add-to-list 'treesit-language-source-alist
;;              '(typst "https://github.com/uben0/tree-sitter-typst"))

;; Necessary or else localleader is not detected
;; (add-hook 'typst-ts-mode-hook #'evil-normalize-keymaps))
